#№1
import random

my_list = [str(random.randrange(100)) for _ in range(20)]
print(my_list)

##################################################
#№2
triangle = {"A": tuple(random.randint(-10, 10) for _ in range(2)),
            "B": tuple(random.randint(-10, 10) for _ in range(2)),
            "C": tuple(random.randint(-10, 10) for _ in range(2))}
print(triangle)

##################################################
#№3 Создать функцию my_print, которая принимает в виде параметра строку и печатает ее с тремя символами * вначале и в конце строки.
#Пример:
#my_str = 'I'm the string'
#Печатает ***I'm the string***

def my_print
    file_domains = open("D:/IT/Phyton/test/domains.txt", "r")
    domains_name = []
    for line in file_domains.readlines():
        domains_name.append(line.replace(".", ""))

    print(domains_name)



###################################################
#№4



###################################################
#№4a


###################################################
#№4b



####################################################
#№4c




####################################################
#№5a


####################################################
#№5b



####################################################
#№5c



####################################################
#№5d


