#№1
import random

my_list = [str(random.randrange(100)) for _ in range(20)]
print(my_list)

##################################################
#№2Создать словарь triangle в который записать точки A B C (ключи),
#и их координаты - кортежи (значения), созданные случайным образом с помощью модуля random в диапазоне от -10 до 10 по каждой оси.
coordinates = [tuple(random.randint(-10, 10) for _ in range(2))]
triangle = [key: coordinates for key in "ABC"]

##################################################
#№3



###################################################
#№4



###################################################
#№4a


###################################################
#№4b



####################################################
#№4c




####################################################
#№5a


####################################################
#№5b



####################################################
#№5c



####################################################
#№5d


